# 변수(variable)
# 책상에 시계,라이터,칫솔,펜 이 있다
# 여기서 시계를 값을 10만원이라고 한다
# 시계를 변수이름이라 하고 시계값을 변수값이라고 한다
# 그럼 프로그램 식은
watch = 100000
# 이렇게 쓰고 이제 라이터 값을 300원으로
# 코딩언어로 바꿔쓰면
lighter = 300
# 이렇게 나오고
# 내가 시계와 라이터를 같이 팔라고 합니다
# 그럼 시계와 라이터는 얼마인지 계산해야 합니다
# 이걸 계산하고 결과값을 출력하려는 코딩식은
print(watch + lighter) # 100300
# 이렇게 뜨는거를 볼수있습니다

# 이번에는 시계를 중고로 15%로 싸게 팔거에요
# 그럼 여기서 15%싸게 팔면 얼마가 나오는 계산하는거를
# 코딩언어로 나타내려고 하면
print(100000 * 0.85) #85000
# 이렇게 나오는데
# 그러면 시계값을 15%로 낮쳐진 가격으로
# 변수에 값을 변경할수있습니다

notebook = 5000
notebook = notebook * 0.85
print(notebook) #4250
# 변수를 지정하고 변경하는 기본 빌드는 이것이다
# 그리고 줄여서 표현하고 싶으면
# notebook = 5000
# notebook *= 085
# print(notebook)
# 이렇게 표현할수도 있다
